Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 上辈子她最恨三位哥哥和爸爸，觉得是他们非要逼着自己嫁给徐凤年，毁了自己一辈子的幸福，所以一直对他们怀恨在心。
en_us: In her previous life, she hated her three brothers and father the most for forcing her to marry Xu Fengnian and thus ruining her lifelong happiness. Hence, she had always born a grudge against them.

source: 上辈子她没注意这些， 这辈子注意到了，那这些牛鬼蛇神，就别想接触她男人半分！
en_us: In her previous life, she did not notice that at all but she did in this life. None of those vixens can get close to her man!

source: 上辈子好像就是有个男的，经常叫她小胖，她以为对方是辱骂自己，每一次听到都十分生气。
en_us: In her previous life, there seemed to be a guy who often called her 'fatty' and she would get upset whenever she heard that because she thought that he was insulting her.

source: 上辈子的叶漓就很喜欢她的性子，甚至还曾希望过，要秦柔是她的妈妈就好了。
en_us: In her previous life, Ye Li liked her temperament, and even wished that Qin Rou was her mother.

source: 上辈子的她沉默寡言的，没什么存在感，却也很少会被惩罚。
en_us: In her previous life, she was quiet most of the time and did not have much of a presence. However, she would rarely get punished too.

source: 上辈子的自己，因为她，受了多少网络暴力和攻击。
en_us: In her previous life, she had suffered a lot of criticism on the Internet and was a victim of cyber bullying because of Ye Mei.

source: 上辈子自己好歹也嫁入了徐家那么多年，对这些还是知道一些的。
en_us: In her previous life, she had been married to Xu Fengnian for a long time and hence, she knew the preferences of his family members.

source: 上辈子自己自杀被救回来之后，本就对哥哥们恨到了极点，又听叶眉这话，直接把他们当仇人一样对待。
en_us: In her previous life, she was filled with extreme hatred towards her brothers after she was rescued from her suicide attempt. When she heard Ye Mei's words, she treated them like her enemies.

source: 上辈子自己自杀过后，好像是也被徐家邀请过去。
en_us: After she committed suicide in her previous life, the Xu Family had also invited her over.

source: 上辈子遭受了这一切的叶漓，性格也变得十分胆小自卑，甚至在叶眉的各种劝说之下，差点跑去医院整容。
en_us: Ye Li, who had suffered all of that in her previous life, had also become extremely timid and she even developed an inferiority complex. In fact, she even almost went to the hospital to get plastic surgery under Ye Mei's various persuasions.

source: 上面早已提醒，若是接到金色邀请函，那便是徐家的重点接待对象。
en_us: In the morning, they had already received instructions and were informed that guests with golden invitation cards were VIP guests of the Xu Family.

source: 下一秒，她的眼睛猛地睁开，扩散的瞳孔在一瞬间收缩，脸上还带着愤怒和惊恐绝望。
en_us: In the next second, she opened her eyes abruptly and her dilated pupils constricted immediately while infuriation, panic, and despair were written all over her face.

source: 下定了决心，叶漓起身去了浴室洗漱。
en_us: Having made up her mind, Ye Li got up and went to the bathroom to wash up.

source: 下意识的惊呼，一下就引起了女孩的注意。
en_us: Her subconscious exclamation immediately attracted the attention of that girl.

source: 下面只有一条微博，转发评论都上百万，这样的数据堪称恐怖！
en_us: There was a tweet of hers that was retweeted more than a million times and that was indeed a horrifying number!

source: 下面第一条微博，就是穿着夏夜之星礼服拍摄的照片。
en_us: The first tweet below her profile was the photo that Ye Mei had taken of herself wearing the Stars of the Summer Night gown.

source: 不仅是公司资源少的可怜，其他的公司也不愿意聘请他去拍广告，眼看着一个个的节目被别的人取而代之，于向阳是真的慌了。
en_us: Not only did he lose many of his resources, the other companies did not want to hire him for advertisements either. Yu Xiangyang began to panic as he watched himself get replaced by other artistes for the filming of variety programs.

source: 不可谓不小。
en_us: It was not a trivial matter at all.

source: 不同于叶眉的骨感美，她给人的感觉更惊艳耐看。
en_us: Unlike Ye Mei who was beautifully thin, she looked stunning and her beautiful charm was long-lasting.

source: 不在乎这些身外之物的叶漓当时也没放在心上，反正她想要钱也是随随时时就能到手，便忘了这件事。
en_us: Ye Li, who did not care much about material possessions, did not take the matter to hard. Anyway, it was a piece of cake for her to get money from her family. Hence, she put that incident behind her and forgot about it.

source: 不少人的眼神都带了几分艳羡。
en_us: Many people were looking at them, green with envy.

source: 不少人跑到了叶漓评论区下面讨伐。
en_us: Many people started confronting Ye Li by replying to her tweets.

source: 不少人都惊讶的朝着这边看了过来。
en_us: A lot of them looked over in surprise.

source: 不少同学们每天都会在校园门口蹲学校的诸位风云人物，亦或者是像是狗仔一样偷拍，然后发去贴吧或是微博，引起话题。
en_us: Many students would squat in front of the campus every day to catch a glimpse of the famous figures in school or snap a series of photos of them like the paparazzi, which they would then upload onto the forum or Weibo to start a topic.

source: 不少粉丝也来指责他们。
en_us: Many fans began slamming the fashion label.

source: 不少粉丝本就好奇枫神的妹妹到底长什么样，这会儿看到有人这么说，顿时就点进去。
en_us: Many fans were already curious about what Ye Feng's younger sister looked like and after seeing that there was a discussion about it, they immediately tapped on the tweet.

source: 不少路过的人的目光都停在了豪车身上。
en_us: Many of the passersby kept their eyes fixed on the luxury car.

source: 不是吧，还不走，这是等着自己喂狗粮？
en_us: 'Seriously? They're still here? Are they trying to flaunt their loving relationship in front of me?"

source: 不是说叶家只有一个千金小姐吗？
en_us: 'Didn't they say that there's only one heiress of the Ye Family?'

source: 不然他也不会抛下身份和对叶漓的厌恶，主动找上门求原谅！
en_us: Otherwise, he would not have swallowed his pride, put aside his disgust with Ye Li, and take the initiative to seek their forgiveness.

source: 不然还有谁能让三人用这样的态度对待。
en_us: Otherwise, who else would have the power to make them change their attitudes?

source: 不知道这个男人知道，到时候会不会生气。
en_us: She wondered if Xu Fengnian would be infuriated when he found out.

source: 不管如此，这辈子，她绝对不允许那样的事情发生了。
en_us: No matter what, she would never allow that to happen again in this lifetime.

source: 不管怎么样，她也是叶明的女儿，她也是这座庄园的千金小姐，凭什么要这样对她？
en_us: No matter what, she was still Ye Ming's daughter, a daughter of the Ye Family, and the heiress of this manor. Why did she have to be treated that way?

source: 不管是叶家人还是徐家人，上辈子都曾被她伤过，自己无数次的让他们失望。
en_us: Be it the Xu Family or the Ye Family, she had hurt the elders in her previous life and disappointed them countless times before.

source: 不讨人喜欢不说，身材还差，好几次叶漓都在怀疑，自己是否亲生，不然为何家中随便一个都是颜值顶峰的强者，就她那般平凡？
en_us: Not only was she unlikable, she did not have a gorgeous figure either. On several occasions, Ye Li even suspected if she was their biological daughter. Otherwise, how could she have such ordinary looks when all the other members of her family were extremely good-looking?

source: 不过也因这件事，徐家被分割成了两派。
en_us: However, that also caused the members of the Xu Family to split into two sides.

source: 不过今儿个的叶漓的打扮倒是出乎人的意料，仿佛换了一个人一般。
en_us: However, Ye Li's appearance today had caught her off guard as she seemed like a completely different person.

source: 不过叶漓这次的作为确实有些过分了，再加上她的影响确实太大，他不免也有些犹豫了起来，看向叶漓，“你怎么说？”
en_us: However, what Ye Li did this time was really a bit too much. Besides, she was indeed very influential and he couldn't help but hesitate a little. Looking at Ye Li, he asked, "What do you think?"

source: 不过叶眉出了名的善良认识已近深入人心，大家虽然质疑，却也没有多想。
en_us: However, Ye Mei's kind image was deeply rooted in their minds and although they were in doubt of her, they did not give it much thought.

source: 不过大家只当是那两个学生逃课，并没有多想。
en_us: However, they all merely thought that the two students had played truant and did not think much of it.

source: 不过大家知道了叶漓是叶枫的妹妹，叶眉的粉丝很快也来评论区刷起了存在感。
en_us: However, after it was revealed that Ye Li was Ye Feng's younger sister, Ye Mei's fans began to reply to it too, so as to make their presence known.

source: 不过就是把你这上不得台面的身份说了出来而已，就装不下去了？
en_us: 'I've merely highlighted your disdainful identity and you're already finding it hard to keep up with the pretense?'

source: 不过徐凤年也太直了吧，难怪这么多年下来，都没听说过他交过女朋友。
en_us: 'However, Xu Fengnian is a little too blunt, isn't he? No wonder I've never heard of him having a girlfriend throughout all these years.'

source: 不过没关系。
en_us: However, it didn't matter.

source: 不过现在这样的速度叶漓也比较满意。
en_us: Ye Li was rather satisfied with the rate of her weight loss.

source: 不过秦柔和叶眉都是聪明人，知道如何放低身份，也十分懂事，不吵不闹，这些年来倒是获取了不少人的好感。
en_us: However, both Ye Mei and Qin Rou were smart enough to know how to swallow their pride, stay humble, behave themselves and not cause any trouble. Hence, over the years, they managed to get into the good books of many people.

source: 不过这也代表着，他并没有把自己当外人。
en_us: 'However, that also means that he doesn't treat me as an outsider.'

source: 不过那男人对自家小妹好的很，阿漓跟着他，叶洛心里也放心了于是沉声道：“既然他处理了，你们就继续观察吧，对了，那些谣言查到是谁传播出去的吗？”
en_us: However Xu Fengnian treated Ye Li very well and Ye Luo was at ease to hear that she was with him. "Since he has settled it, you guys continue to observe. By the way, did you find out who spread those rumors?"

source: 不过，大多都是来骂她的。
en_us: However, most of them were berating her.

source: 与此同时，一栋欧式豪华风格的别墅二楼，书房内，穿着白色衬衫的男人正坐在书桌前工作，他脖颈处的纽扣微微解开了两颗，从作者这个角度隐约可见的能看到几分肌肉线条，给男人增添了几分性感。
en_us: At the same time, there was a man seated in front of a desk in the study on the second floor of a European-style luxurious mansion, and doing some work. He was wearing a white shirt which had two unbuttoned buttons. The outline of his muscles could be seen vaguely, giving him a sexy, masculine charm.

source: 世界上最完美的三个男人，都是她的哥哥，最疼她最宠她，可上辈子的自己却恨了他们半辈子。
en_us: The three most perfect men in the world were all her brothers, who loved and pampered her the most. However, in her previous life, she hated them for half a lifetime.

source: 两个人得了好处，又看叶眉竟然这么有钱，讨好的话是一句接着一句，夸得叶眉都有些飘飘然了起来。
en_us: Having gained some benefits and realizing how wealthy Ye Mei was, they said many things to please her, causing Ye Mei to feel smug and proud.

source: 两个女生一听这话，顿时就黑了脸。
en_us: The faces of the girls turned sullen immediately after hearing her words.

source: 两个女生彻底恼了。
en_us: The two girls were completely enraged.

source: 两个女生本来都做好了贪便宜的准备。
en_us: The two girls were already ready to take advantage of her and get some benefits.

source: 两个女生欢呼了一声，赶忙跑了进去。
en_us: The girls squealed in joy and hurriedly dashed into the store.

source: 两个女生顿时点头凑了上来，很是兴奋。
en_us: The two girls immediately nodded and leaned in excitedly.

source: 两个小时之后。
en_us: Two hours later, Ye Li and Xu Fengnian walked out of the Civil Administrative Bureau together, hand in hand.

source: 两个觊觎自家家产的人，会那么为她着想？
en_us: How could two people who coveted her family's wealth be so concerned about her wellbeing?

source: 两人一唱一和，大家也算是明白了。
en_us: The two of them were singing the same tune and everyone understood what was going on.

source: 两人一噎。
en_us: They choked.

source: 两人你一眼我一语的说着，顿时就让大家觉得叶漓过于咄咄逼人。
en_us: The two of them chimed in and everyone immediately began to find that Ye Li was being too overbearing.

source: 两人威胁的道。
en_us: The two of them threatened.

source: 两人小声劝道。
en_us: The two of them persuaded softly.

source: 两人幸灾乐祸的对视一眼。
en_us: The two girls looked at each other gloatingly.

source: 两人是同桌亦是好姐妹，关系十分的好。
en_us: The two of them were desk-mates and good friends who shared a close relationship with each other.

source: 两人玩了也有几年了，一起进军娱乐圈，一起发展，没有感情是不可能的。
en_us: They had been close friends for several years now. They had entered the entertainment industry and built each of their careers together. It was impossible for Ye Feng to not feel anything for him.

source: 两人的欢呼声，引起了周围不少客人的注意。
en_us: Their exclamations attracted the attention of many other customers in the store.

source: 两人的眼神在空气中相接，众人顿时感觉周围的空气一窒。
en_us: When the two of them made eye contact, everyone immediately felt a strong tension in the air.

source: 两人看着被叶漓和叶枫两兄妹刷屏的微博，脸色都很难看。
en_us: Both of them were reading the tweets posted on Twitter by Ye Feng and Ye Li, with sullen expressions.

source: 两人脸色都不大好看，听叶眉这么一说，才稍稍缓了口气。
en_us: They both had sullen expressions and only heaved a sigh of relief after hearing Ye Mei's words.

source: 两人身上的裙子，都是七位数以上。
en_us: The gowns that they had chosen were at least hundreds of thousands of dollars each.

source: 两人这话刚说完，就对上了要走出洗手间的叶漓。
en_us: As soon as they finished speaking, they ran into Ye Li who was walking out of the bathroom.

source: 两人都各怀心思，暗暗想着接下来的计划。
en_us: With thoughts of their own, the both of them secretly began pondering over their next plan.

source: 两人都无比惊愕的看着对方。
en_us: Both of them looked at each other in shock.

source: 两兄弟自然是没什么好说的。
en_us: There was nothing much for the brothers to say to each other.

source: 两方原本和睦的粉丝纷纷在网上开始互相指责了起来，事情闹得很大，几乎一打开手机就是这个新闻。
en_us: Their respective fanclubs which initially got along with each other harmoniously, began blaming each other and the matter soon escalated and got blown out of hand. The news were almost rampant and would show up on everyone's mobile phone.

source: 两方都没有出来澄清，这事大家也不知道到底是谁的错，也都在猜测着。
en_us: Neither party came forth to clarify matters and no one knew who was at fault. They were all just making speculations.

source: 个个危襟正坐，没有一人说话。
en_us: They were all seated upright but no one was talking.

source: 中午因为鱼庄被包场的原因，害的她们没能见到偶像，只能遗憾离开。
en_us: Due to the fact that the fish restaurant was booked in the afternoon, they did not get to see their idol and could only leave regretfully.

source: 为了前程，他又有什么做不出来。
en_us: 'There's nothing he won't do for the sake of his future.'

source: 为什么叶漓就那么差。
en_us: Yet, Ye Li was so much more inferior.

source: 为什么叶漓的性格那么差，所有的人都还是那么宠她。
en_us: 'Why does everyone dote on Ye Li even though she's got such a poor character?'

source: 为什么总是觉得，叶枫对叶漓那么娇宠，可对叶眉向来不闻不问。
en_us: He had always wondered why Ye Feng pampered Ye Li that much but he had never shown any concern to Ye Mei.

source: 为此，她还同徐凤年冷战了许久。
en_us: As a result, Ye Li gave Xu Fengnian the cold shoulder for a long time.

source: 久而久之，几乎所有人都已经忘了她这人的存在。
en_us: Over time, almost everyone had forgotten about her existence.

source: 之前叶漓确实是拿她当亲姐妹的，一直觉得对妹妹好是天经地义，所以向来大方，出去逛街的消费，都是她来买单。
en_us: Previously, Ye Li indeed treated her as her own sister and she used to think that it was only right for her to treat her sister well and dote on her. Hence, she had always been generous with Ye Mei and would cover all the expenses when she took Ye Mei out for shopping.

source: 之前女儿班主任打电话的时候，明明说叶漓不过就是一普通家庭的人。
en_us: Previously, when the teacher called him, she clearly said that Ye Li was from an ordinary family.

source: 之前她对二小姐的话，可是唯命是从的，甚至只听得进去她的话，别人给的建议，她反倒是充其不闻。
en_us: Previously, Ye Li had always went along with every suggestion Ye Mei made. In fact, Ye Mei was the only person she listened to and she would ignore ev everyone else's advice.

source: 之前她还不小心掉在了地上，他扫了一眼就记住了。
en_us: He remembered the card number after taking a glance when she accidentally dropped it on the ground previously.

source: 之前对自己的态度那么冷淡，这会儿倒像是变了个人。
en_us: Previously, she was extremely indifferent towards him but her attitude had changed greatly.

source: 之前就是因为脸大，所以叶漓才会留那么多的刘海，还天真的以为遮挡了大脸盆，就能漂亮。
en_us: Previously, Ye Li decided to have bangs because of how large her face was. She even naively thought that she would look better with the bangs covering her face.

source: 之前有一次同叶漓出去逛街，她特意打听过这张卡的余额，叶漓说是有好几亿在里面，她刷都刷不完。
en_us: During a shopping trip with Ye Li previously, she deliberately asked about the balance in the card and Ye Li told her that there was a credit limit of hundreds of millions of dollars, which she would never finish spending.

source: 之前自己这么叫她的时候，她都会十分生气。
en_us: 'When I called her that last time, she would get really mad at me.'

source: 之前还趾高气扬的几个女人，这会儿却是一脸惶恐。
en_us: The few women who were still being haughty previously, were now in horrified.

source: 之前这个叶漓就经常不交论文，但是她都睁一只眼闭一只眼懒得管她。
en_us: Previously, Ye Li often failed to submit her papers but Cheng Yan would usually just turn a blind eye to it as she could not be bothered to care about her.

source: 之后一家人的关系都降到了冰点。
en_us: Afterwards, her relationship with her family became extremely strained.

source: 之后叶家出了事情，这些事情才缓缓露出水面。
en_us: Later on, those matters were slowly uncovered because something happened to the Ye Family.

source: 之后叶漓的性情大变，从来没有受过这样委屈的她怎么可能忍受的了，为此还和老师吵了一架，便被人传播成了不良学生。
en_us: After that, there was a drastic change in Ye Li's character. Since she had never been wronged and aggrieved before, how could she have tolerated it? She even got into an argument with the teacher because of that matter and everyone started calling her a delinquent.

source: 之后她对学校校草排行榜上第二名的于向阳纠缠不清之后，更是被全校人所嫌恶，那评论区的评论，都被癞蛤蟆想吃天鹅肉给刷屏了。
en_us: Afterwards, she became obsessed with Yu Xiangyang, who was ranked second on the campus "Handsomest Boy" ranking, and got detested by all students in school. Most of the comments in the comment section were criticizing her for lusting over someone who was out of her league.

source: 之后秦家那边以孩子相逼，非要将秦柔母女送来，叶家碍于颜面，不得已才收了人。
en_us: Afterwards, using the child as an excuse, the Qin Family insisted on sending Qin Rou and Ye Mei to the Ye Family. The Ye Family then had no choice but to accept them and take them in.

source: 乍一看不是那么惊艳，可仔细打量，却发现这女儿的五官真的是漂亮的不行。
en_us: At first glance, she wasn't stunningly gorgeous but if one were to look closely at her, they would discover how beautiful her features were.

source: 九千九百九十九万，她就是连自己母亲也不敢开口。
en_us: 14 million dollars was a staggering sum of money that she wouldn't dare to even ask her mother for, let alone her father, Ye Ming.

source: 也不知道她到底是太单纯，还是故意。
en_us: 'I wonder if she's too simple or just doing it on purpose.'

source: 也不知道是谁偷拍了她的照片，放上了校园贴吧，还将叶眉的照片拿出来对比，一时之间，叶漓遭到了不少嘲笑的目光，成为了大家口中的热门笑话。
en_us: Someone secretly took a photo of her and uploaded it onto the campus forum. They even compared it with Ye Mei's picture and all of a sudden, many people looked at Ye Li with mockery and she became a laughing stock and the talk of the town.

source: 也就是借助着大学积累的这些粉丝，还没毕业，就被不少娱乐大公司争相抢夺，最后同于向阳进了同一娱乐公司，迅速就发展成了一线明星。
en_us: Relying on the fans she had gained in college, Ye Li shot to fame and many major entertainment companies vied with each other to sign her on. In the end, she entered the same entertainment company as Yu Xiangyang and developed rapidly into an A-list celebrity.

source: 也就是因为这样，圆润的叶漓就格外的显眼起来。
en_us: That was also the reason that the chubby Ye Li became particularly eye-catching.

source: 也就是这样的态度，让叶漓注意到了对方，她是那种越是得不到就越是想要的人，更别说，从小到大，还没有她得不到的东西，于向阳的态度一下就激起了叶漓的逆反心理，对方越是拒绝，她就越不愿意放弃，暗地里打听了不少关于对方的事情，知道他的优秀之后便暗许了芳心，自此一发不可收拾。
en_us: His aloof attitude was precisely the reason Ye Li paid attention to him. She was the type who would desperately want what she couldn't get. Besides, ever since she was a child, she would always get whatever she wanted. Yu Xiangyang's attitude immediately aroused Ye Li's rebellious spirit and the more resistant he was towards her, the more unwilling she was to give up. She secretly found out a lot of information about him and after she discovered how brilliant he was, she began to carry a torch for him. Since then, things went out of control.

source: 也有些人站出来维护，“是咱们粉丝先骂她她才发微博的，其实我觉得也没毛病啊。”
en_us: There were also some who voiced out to defend Ye Li. "She only sent that tweet on Twitter because we started slamming her first. Actually, I don't think there's anything wrong with what she did."

source: 也正是因为很少会见到这三位哥哥，也导致了他们几个兄妹的关系越发的不亲近起来，倒是每天同叶眉上课下课，关系好得不得了。
en_us: The fact that she rarely got to see her brothers was precisely the reason that the siblings began to grow distant from each other. Instead, Ye Li got extremely close to Ye Mei whom she went to school with everyday.

source: 也没听见他们总裁大人发怒的声音，众人疑惑看去，却见刚刚还认真看着文件的总裁，不知何时手中多了一个手机，他正一瞬不瞬的盯着屏幕看，好似还有些呆。
en_us: They did not hear the angry holler of their esteemed CEO. They looked over in bewilderment and to their surprise, the CEO who had just been reading some documents attentively was suddenly holding his mobile phone and staring at the screen, seemingly spacing out too.

source: 也罢，再等一段时间，如果真的如同他们猜测的那样的话，他不信叶漓能够熬得住不来找他。
en_us: 'Forget it, I'll just wait for a while. If it's really like what we guessed, Ye Li will definitely come looking for me."

source: 二十岁了，也到了领证的年纪不是么？
en_us: 'At the age of twenty, I should be old enough to be legally married, right?'

source: 二十岁的人了，脸上还带着可爱的婴儿肥。
en_us: Although she was already 20 years old, there was still some adorable baby fat on her face.

source: 二夫人一家最担心的就是她嫁给徐凤年。
en_us: Kong Yun had always been worried about her getting married to Xu Fengnian because the Ye Family was extremely powerful.

source: 二夫人先移开了目光，一副歉意的表情，“大嫂说的对，我好多年没注意这些年轻人的八卦了，所以听别人这么一说，就放在了心上，这会儿也想着解决问题所以才提出来，若是冒犯了阿漓，阿姨在这里向你道歉。”她无奈道。
en_us: Kong Yun was the first to look away. She said helplessly with an apologetic expression, "You're right, I haven't paid attention to the gossip of these young people for a long time so I didn't take it to heart after hearing them talk about this. I only mentioned it because i want to solve the matter. If I offended Ye Li, I hereby apologize."

source: 二夫人和女儿对视一眼，倒也没想到叶漓回这么爽快的承认了。
en_us: Kong Yun and Xu Yuan looked at each other, not expecting Ye Li to agree so readily.

source: 二夫人愣住，没听懂是什么意思。
en_us: Kong Yun was stunned and she did not quite understand what he meant.

source: 二夫人拉着女儿坐到了大夫人身旁。
en_us: Kong Yun pulled her daughter along and took a seat beside Mrs. Xu.

source: 二夫人故作好奇的问道。
en_us: Kong Yun asked, pretending to be curious.

source: 二夫人若有所思的看着叶漓。
en_us: Kong Yun looked at Ye Li while pondering about something.

source: 二夫人这几天一直忙着宴会的事情，倒是没有注意这个情况，闻言眯了眯眼：“是吗？她倒是不安生的很，之前我就查到了不少她去纠缠别人的资料，呵~真没想到，秦歌那样洁身自爱的女人，竟然会生了这么一个不知廉耻的女儿，若是她地下有知，估计都会被气的再死一次吧！”
en_us: Having been busy with making arrangements for the social gathering the past few days, Kong Yun did not pay attention to that matter. After hearing her words, she squinted and asked, "Is that so? She's quite a troublemaker. I found out a lot of information about her pestering others. I didn't expect that a woman as morally upright and chaste as Qin Ge would give birth to such a shameless daughter. If she knows about this in the underworld, she would probably die again out of anger!"

source: 二夫人闻言，蹙了蹙眉，发生这种事情，没有那个男人能接受的了吧。
en_us: Upon hearing her words, Kong Yun frowned. No man would be able to tolerate such a matter.

source: 二房只有一个女儿，徐媛。
en_us: Xu Fengnian's brother only had one daughter, Xu Yuan.

source: 二是徐凤年稳重可靠，又对她是顶尖的好，人品不错，能力优秀，妹妹嫁给她，他们也放心。
en_us: Secondly, it was because Xu Fengnian was trustworthy and reliable, and also treated her extremely well. He had a good character and was incredibly competent. They felt safe about letting their younger sister marry him.

source: 二楼，将这一幕看在眼中的徐媛微微蹙了蹙眉，对着一旁穿着鱼尾裙，卷着大波浪的性感女人开口，“妈，你不是说叶家那边不同意这门婚事的吗？”
en_us: On the second floor, Xu Yuan, who had witnessed everything, frowned a little and said to the sexy woman beside her who was wearing a fishtail-hem dress and had wavy hair, "Mother, didn't you say that the Ye Family didn't agree to the marriage?"

source: 于向阳今儿个本来是过来道歉的。
en_us: Yu Xiangyang was actually there to offer his apology.

source: 于向阳坐在她的对面，包厢里只有两个人。
en_us: They were the only ones in the private room.

source: 于向阳心中有了解释，也就没多想，一脸真诚的道：“阿漓，对不起，那天我心情不好，所以对你说话的语气可能过分了一些，我希望你能原谅我，以后你说什么我都听你的好么？”
en_us: After finding an explanation himself, Yu Xiangyang stopped thinking about it and said sincerely, "Li, I'm sorry, I was in a foul mood that day so I might have gone overboard with my words. I hope that you can forgive me. I'll listen to everything you say from now on, alright?"

source: 于向阳抬起歉意的目光，看向叶漓，却对上了一双冰冷却漂亮至极的眸子。
en_us: Yu Xiangyang looked up at Ye Li apologetically, only to meet a pair of cold yet gorgeous eyes.

source: 于向阳没想到叶枫当真这么无情，丝毫面子都不愿给他，他涨红了脸，只感觉到了一阵屈辱。
en_us: Yu Xiangyang did not expect Ye Feng to be so heartless as to cut him off completely without giving him any chances. His face was flushed and he was overwhelmed with humiliation.

source: 于向阳甚至都觉得自己是不是出了幻觉，不然为什么之前那个看到他就羞涩的脸都不敢抬的女孩会变成了这样？
en_us: Yu Xiangyang even felt that he was hallucinating as he could not find an explanation for the drastic change in attitude of the girl who used to be too shy to even look at him in the past.

source: 于向阳的脸色很是难看，他这次若是走了，恐是很难再找到这种机会。
en_us: Yu Xiangyang had a sullen expression and he knew that if he were to leave this time, it would be difficult for him to find another opportunity like this.

source: 于向阳的表情也是微微一怔。
en_us: Yu Xiangyang was slightly stunned too as shock was written all over his face.
